package com.example.toshiba.yaleastemari.Questions;


public  class QuestionLibrary {


    //level 1
    public static String[][] choice_level1 = new String[][]{
            {"ለ","ሠ","ሸ","ሀ","መ","ረ"},//ሀ
            {"ቀ","በ","ኔ","ሉ","ት","ቸ"},//በ
            {"ሄ","ዙ","ወ","ሎ","ከ","ማ"},//ከ
            {"ለ","ሩ","ና","ቁ","ቲ","አ"},//ለ
            {"ሊ","ዘ","መ","ኔ","ኘ","ዠ"},//ዘ
    };

    //level 2
    static String[][] choice_level2 = new String[][]{
            {"ፍ","ሀ","ህ","ሐ","ኀ","ም"},//ህ
            {"ጠ","ጨ","ጯ","ጣ","ተ","ጫ"},//ጨ
            {"ሰ","ሐ","መ","ጨ","ፀ","ወ"},//መ
            {"ሰ","ፈ","ኸ","ፍ","ረ","ሣ"},//ፈ
            {"ሙ","ሡ","ሁ","ሉ","ጩ","ዉ"},//ዉ
    };

    //level 3
    static String[][] choice_level3 = new String[][]{
            {"ባ","ቡ","ኪ","ቤ","ቦ","ሰ"},//ቦ
            {"ታ","ቷ","ፓ","ፐ","ነ","ቱ"}, //ታ
            {"ዮ","ዱ","ጅ","ያ","ድ","ዶ"}, //ድ
            {"ኩ","ኹ","ስ","ቧ","ኮ","ከ"}, //ኩ
            {"ጅ","ጃ","ጆ","ጀ","ጁ","ጂ"},//ጆ
    };

    //level 4
    static String[][] choice_level4 = new String[][]{
            {"ፋ","ፍ","ር","ፉ","ሯ","ላ"},//ፉ
            {"ሣ","ዣ","ሦ","ቾ","ሥ","ጮ"},//ሦ
            {"ራ","ሯ","ፍ","ፏ","ሪ","ሏ"},//ራ
            {"ጸ","ጰ","ጵ","ጽ","ጻ","ጶ"},//ጽ
            {"ቾ","ቶ","ጮ","ሾ","ዧ","ቿ"},//ቾ
    };

    //level 5
    static String[][] choice_level5 = new String[][]{
            {"ፃ","ዓ","ዖ","የ","ያ","ኧ"},//ዓ
            {"ነ","ኘ","ኝ","ኛ","ን","ኞ"},//ን
            {"ተ","ቸ","ቻ","ታ","ቶ","ቾ"},//ቶ
            {"ዘ","ዠ","ዥ","ዝ","ዡ","ዚ"},//ዥ
            {"ቶ","ቾ","ቄ","ቆ","ኮ","ጎ"},//ቆ
    };
    static String[][] choice_level6 = new String[][]{
            {"ፓ","ቿ","ፕ","ፗ","ታ","ፖ"},//ፖ
            {"ጨ","ጩ","ጮ","ጬ","ጯ","ጪ"},//ጬ
            {"ዩ","ዬ","ዪ","ዱ","ዮ","ዲ"}, //ዪ
            {"ኆ","ኖ","ኋ","ኄ","ኞ","ፎ"},//ኆ
            {"ፆ","ፃ","ዕ","ፅ","ዖ","ዔ"},// ፆ
    };

    /**
     * the skeleton ends here
     */

    /**
     * sound path for the choice start here
     * since there are 5 levels there will be 5 row and
     * there will be 5 col since the re are 5 questions in each level
     */



    public static String [][] CorrectAnswer = new String[][]{
            {"ሀ","በ","ከ","ለ","ዘ"},
            {"ህ","ጨ","መ","ፈ","ዉ"},
            {"ቦ","ታ","ድ","ኩ","ጆ"},
            {"ፉ","ሦ","ራ","ጽ","ቾ"},
            {"ዓ","ን","ቶ","ዥ","ቆ"},
            {"ፖ","ጬ","ዪ","ኆ","ፆ"}};


}
